In [10]:
import pandas as pd
# importa pandas
df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")
#pega a base de dados

In [11]:
df.head()
# visualiza os 5 primeiros
df.head(20)
# visualiza os 20 primeiros
df.tail(10)
# visualiza os 10 últimos
df.tail(2)
#visualiza os 2 últimos

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
133347,2020.0,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
133348,2021.0,SE,FT,Data Scientist,7000000,INR,94665,IN,50,IN,L

In [12]:
df.info()
#verifica os tipos dos dados

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [13]:
df.describe()
# descricao mais aprofundada das informações
# count: número de valores não nulos
# mean: média
# std: desvio padrão
# min: valor mínimo
# 25%: primeiro quartil (Q1)
# 50%: mediana (Q2)
# 75%: terceiro quartil (Q3)
# max: valor máximo

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [14]:
df['work_year'].std()
# Desvio padrão baixo (como 0.68) = dados próximos entre si.
# Desvio padrão alto (ex: 10, 50...) = dados mais espalhados.

np.float64(0.6806266087848142)

In [15]:
df.shape
# número de linhas x colunas

(133349, 11)

In [16]:
linhas, colunas = df.shape[0],df.shape[1]
# criando variaveis linhas e colunas para pegarmos os valores da posicao 0 e 1 
linhas
# verificando o valor de linhas

133349

In [17]:
colunas
# verificando o valor de colunas
print('Colunas - ',colunas)

Colunas -  11

In [18]:
# verificando o valor de linhas
print('Linhas - ',linhas)

Linhas -  133349

In [19]:
df.columns
# pega o nome de colunas

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [20]:
# Dicionário, renomeando as colunas com novos nomes em portugues
novos_nomes = {
    'work_year': 'ano',
    'experience_level': 'senioridade',
    'employment_type': 'contrato',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_currency': 'moeda',
    'salary_in_usd': 'usd',
    'employee_residence': 'residencia',
    'remote_ratio': 'remoto',
    'company_location': 'empresa',
    'company_size': 'tamanho_empresa'
}

# Aplicando renomeação
df.rename(columns=novos_nomes, inplace=True)

# Verificando resultado
df.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [21]:
#Qual a frequencia de categoria de cada coluna
# O método .value_counts() serve para contar quantas vezes cada valor único aparece em uma coluna.
df["senioridade"].value_counts()
#SENIOR / MID / ENTRY / EXECUTIVE

senioridade
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

In [22]:
#Analisar tipo do emprego/contrato
df['contrato'].value_counts()
#FULL TIME / CONTRACT / PART TIME / FREELANCER

contrato
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [23]:
#Analisar modelo de trabalho remoto
df['remoto'].value_counts()
# 0 -- Presenciais
# 100 -- Remotos
# 50  -- Hibridos

remoto
0      105312
100     27718
50        319
Name: count, dtype: int64

In [24]:
#Tamanho da empresa
df['tamanho_empresa'].value_counts()

tamanho_empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

In [25]:
#Substituir siglas de Senioridade
substitui_senior = {
    'SE': 'Senior',
    'MI': 'Pleno',
    'EN': 'Junior',
    'EX': 'Executivo'
}

#usa o map para modificar 
df['senioridade']= df['senioridade'].replace(substitui_senior)

In [26]:
df['senioridade'].value_counts()

senioridade
Senior       77241
Pleno        40465
Junior       12443
Executivo     3200
Name: count, dtype: int64

In [27]:
#Substituir siglas de Contrato
contrato_novo = {
    'FT': 'Tempo Integral',
    'PT': 'Tempo Parcial',
    'FL': 'Freelancer',
    'CT': 'Contrato'
}

#usa o map para modificar 
df['contrato']= df['contrato'].replace(contrato_novo)

In [28]:
df['contrato'].value_counts()

contrato
Tempo Integral    132563
Contrato             394
Tempo Parcial        376
Freelancer            16
Name: count, dtype: int64

In [29]:
df.describe(include='object')
#Count = contagem
#unique = dados unicos
# top = informações mais frequentes
# freq = calculo da frequencia - quantas vezes se repete a info

,senioridade,contrato,cargo,moeda,residencia,empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,95,3
top,Senior,Tempo Integral,Data Scientist,USD,US,US,M
freq,77241,132563,17314,126140,119579,119641,129561

In [30]:
## TRATAMENTO DE DADOS ###

In [31]:
df.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,0,US,M

In [32]:
df.isnull()
# Usando isnull(), pegamos TODOS os campos vazios

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
133344,False,False,False,False,False,False,False,False,False,False,False
133345,False,False,False,False,False,False,False,False,False,False,False
133346,False,False,False,False,False,False,False,False,False,False,False
133347,False,False,False,False,False,False,False,False,False,False,False
133348,False,False,False,False,False,False,False,False,False,False,False

In [33]:
df.isnull().sum()
# Nessa formula, adicionamos o .sum() para sabermos quantos campos faltam ser preenchidos, no caso, 
# evidenciamos que a coluna de ANO possui dados incompletos!

ano                10
senioridade         0
contrato            0
cargo               0
salario             0
moeda               0
usd                 0
residencia          0
remoto              0
empresa             0
tamanho_empresa     0
dtype: int64

In [34]:
df['ano'].unique()
# Vamos verifica os dados unicos do ano, no caso, temos o NaN (not a number)

array([2025.,   nan, 2024., 2022., 2023., 2020., 2021.])

In [35]:
df[df.isnull().any(axis=1)]
#vamos fazer uma visualização da tabela df, puxando todos os campos de df que são nulos

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
5588,NaN,Senior,Tempo Integral,Product Manager,184500,USD,184500,US,0,US,M
59692,NaN,Pleno,Tempo Integral,Engineer,110000,USD,110000,DE,0,DE,M
59710,NaN,Junior,Tempo Integral,Data Scientist,208800,USD,208800,US,0,US,M
59759,NaN,Senior,Tempo Integral,Software Engineer,135000,USD,135000,US,0,US,M
59789,NaN,Senior,Tempo Integral,Engineer,112000,USD,112000,US,0,US,M
131000,NaN,Senior,Tempo Integral,Machine Learning Engineer,163800,USD,163800,US,0,US,M
131006,NaN,Senior,Tempo Integral,Data Analytics Manager,204500,USD,204500,US,0,US,M
133054,NaN,Junior,Tempo Integral,Data Scientist,40000,USD,40000,JP,100,MY,L
133281,NaN,Pleno,Tempo Integral,Machine Learning Engineer,180000,PLN,46597,PL,100,PL,L
133317,NaN,Pleno,Tempo Integral,Data Scientist,130000,USD,130000,US,50,US,L

In [36]:
#Vamos criar um DATAFRAME do zero, chamado Salarios

import numpy as np

In [37]:
df_salarios = pd.DataFrame({
    'nome': ["carlos","andre","guilherme","caio","bruna","mikaele","dila"],
    'salario': [7200,np.nan,5000,np.nan,6230,1900,2100]
})

#CRIANDO UMA MEDIA


#df_salarios['salario_media'] = df_salarios['salario'].fillna(df_salarios['salario'].mean().round(2)) 
df_salarios['salario_media'] = df_salarios['salario'].fillna(round(df_salarios['salario'].mean(), 2))
df_salarios
# fillna preenche os valores nulos

        nome  salario  salario_media
0     carlos   7200.0         7200.0
1      andre      NaN         4486.0
2  guilherme   5000.0         5000.0
3       caio      NaN         4486.0
4      bruna   6230.0         6230.0
5    mikaele   1900.0         1900.0
6       dila   2100.0         2100.0

In [38]:
#CRIANDO UMA MEDIANA

df_salarios['salario_mediana'] = df_salarios['salario'].fillna(round(df_salarios['salario'].median(), 2))
df_salarios

        nome  salario  salario_media  salario_mediana
0     carlos   7200.0         7200.0           7200.0
1      andre      NaN         4486.0           5000.0
2  guilherme   5000.0         5000.0           5000.0
3       caio      NaN         4486.0           5000.0
4      bruna   6230.0         6230.0           6230.0
5    mikaele   1900.0         1900.0           1900.0
6       dila   2100.0         2100.0           2100.0

In [39]:

df_temperaturas = pd.DataFrame({
    'Dia': ['Segunda','Terça','Quarta','Quinta','Sexta'],
    'Temperatura': [30, np.nan, np.nan, 25,29]
})

df_temperaturas

       Dia  Temperatura
0  Segunda         30.0
1    Terça          NaN
2   Quarta          NaN
3   Quinta         25.0
4    Sexta         29.0

In [40]:
#Criar nova coluna usando o metodo ffill do pandas
df_temperaturas['preenchido_ffill']= df_temperaturas['Temperatura'].ffill()
# ffill = forward fill, complementa com o valor anterior
df_temperaturas

       Dia  Temperatura  preenchido_ffill
0  Segunda         30.0              30.0
1    Terça          NaN              30.0
2   Quarta          NaN              30.0
3   Quinta         25.0              25.0
4    Sexta         29.0              29.0

In [41]:

df_cidades = pd.DataFrame({
        'nome': ["carlos","andre","guilherme","caio","bruna","mikaele","dila"],
        'cidade': ['SAO PAULO',np.nan,np.nan,np.nan,'CURTIBA','NITEROI','DUQUE DE AXIAS']
})

df_cidades

        nome          cidade
0     carlos       SAO PAULO
1      andre             NaN
2  guilherme             NaN
3       caio             NaN
4      bruna         CURTIBA
5    mikaele         NITEROI
6       dila  DUQUE DE AXIAS

In [42]:
df_cidades['cidade_preenchida'] = df_cidades['cidade'].fillna('Nao Informado')
# preenche as nulls com Nao Informado
df_cidades

        nome          cidade cidade_preenchida
0     carlos       SAO PAULO         SAO PAULO
1      andre             NaN     Nao Informado
2  guilherme             NaN     Nao Informado
3       caio             NaN     Nao Informado
4      bruna         CURTIBA           CURTIBA
5    mikaele         NITEROI           NITEROI
6       dila  DUQUE DE AXIAS    DUQUE DE AXIAS

In [44]:
#vamos agora apagar linhas que contenham vazio

#usamos dropna
df_limpo = df.dropna()
df_limpo.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,0,US,M

In [45]:
df_limpo.info()
# vemos que ano está em float64, mas como Ano nao precisa ser float, vamos transformar em um inteiro.

<class 'pandas.core.frame.DataFrame'>
Index: 133339 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   ano              133339 non-null  float64
 1   senioridade      133339 non-null  object
 2   contrato         133339 non-null  object
 3   cargo            133339 non-null  object
 4   salario          133339 non-null  int64
 5   moeda            133339 non-null  object
 6   usd              133339 non-null  int64
 7   residencia       133339 non-null  object
 8   remoto           133339 non-null  int64
 9   empresa          133339 non-null  object
 10  tamanho_empresa  133339 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 12.2+ MB

In [46]:
#mudando o tipo
df_limpo = df_limpo.assign(ano = df_limpo['ano'].astype('int64'))

df_limpo.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,0,US,M

In [47]:
####### EXERCICIO ###############

'''
1) Crie um DataFrame chamado df_produtos com as seguintes colunas: "produto", "preco" e "quantidade_em_estoque".

2) Adicione pelo menos 5 produtos, sendo que alguns deles devem ter valores nulos na coluna "preco" e "quantidade_em_estoque".

3) Utilize os métodos que aprendemos na aula para:
    - Identificar e contar os valores nulos em cada coluna.
    - Preencher os valores nulos da coluna "preco" com a média dos preços dos produtos.
    - Preencher os valores nulos da coluna "quantidade_em_estoque" com o valor "0" (zero).
Por fim, exiba o DataFrame resultante.
'''

'\n1) Crie um DataFrame chamado df_produtos com as seguintes colunas: "produto", "preco" e "quantidade_em_estoque".\n\n2) Adicione pelo menos 5 produtos, sendo que alguns deles devem ter valores nulos na coluna "preco" e "quantidade_em_estoque".\n\n3) Utilize os métodos que aprendemos na aula para:\n    - Identificar e contar os valores nulos em cada coluna.\n    - Preencher os valores nulos da coluna "preco" com a média dos preços dos produtos.\n    - Preencher os valores nulos da coluna "quantidade_em_estoque" com o valor "0" (zero).\nPor fim, exiba o DataFrame resultante.\n'

In [48]:
# 1 e 2#
df_produtos = pd.DataFrame({
    'produto':['trigo','arroz','feijao','macarrao','oleo','peito de frango'],
    'preco':[4.35,np.nan,4.99,5.50,17.99,np.nan],
    'quantidade_em_estoque':[150,np.nan,350,np.nan,250,np.nan]
})

df_produtos

           produto  preco  quantidade_em_estoque
0            trigo   4.35                  150.0
1            arroz    NaN                    NaN
2           feijao   4.99                  350.0
3         macarrao   5.50                    NaN
4             oleo  17.99                  250.0
5  peito de frango    NaN                    NaN

In [49]:
# Identificando quantos registros tem null
df_produtos.isnull().sum()

produto                  0
preco                    2
quantidade_em_estoque    3
dtype: int64

In [50]:
#Visualizando melhor todos os ISNULL existentes
df_produtos[df_produtos.isnull().any(axis=1)]

           produto  preco  quantidade_em_estoque
1            arroz    NaN                    NaN
3         macarrao    5.5                    NaN
5  peito de frango    NaN                    NaN

In [51]:
#    - Preencher os valores nulos da coluna "preco" com a média dos preços dos produtos.
df_produtos['preco'] = df_produtos['preco'].fillna(round(df_produtos['preco'].mean(), 2))
df_produtos

           produto  preco  quantidade_em_estoque
0            trigo   4.35                  150.0
1            arroz   8.21                    NaN
2           feijao   4.99                  350.0
3         macarrao   5.50                    NaN
4             oleo  17.99                  250.0
5  peito de frango   8.21                    NaN

In [52]:
# - Preencher os valores nulos da coluna "quantidade_em_estoque" com o valor "0" (zero).
df_produtos['quantidade_em_estoque'] = df_produtos['quantidade_em_estoque'].fillna(0)
df_produtos

           produto  preco  quantidade_em_estoque
0            trigo   4.35                  150.0
1            arroz   8.21                    0.0
2           feijao   4.99                  350.0
3         macarrao   5.50                    0.0
4             oleo  17.99                  250.0
5  peito de frango   8.21                    0.0

In [53]:
#mudando o tipo pra ficar mais bonito
df_produtos = df_produtos.assign(quantidade_em_estoque = df_produtos['quantidade_em_estoque'].astype('int64'))
df_produtos

           produto  preco  quantidade_em_estoque
0            trigo   4.35                    150
1            arroz   8.21                      0
2           feijao   4.99                    350
3         macarrao   5.50                      0
4             oleo  17.99                    250
5  peito de frango   8.21                      0